{
    "events":[
        {
            "name":"Mantra Awards",
            "desc":"The Mantra Awards recognize and reward outstanding students who have demonstrated extraordinary leadership potential and/or entrepreneurial initiative.<br>These are the categories for this initiative:<br><br> 1. Mantra Award for Outstanding Leadership – 2 awards (1 male, 1 female)<br> 2. Mantra Entrepreneur of the Year Award<br> 3. Mantra Award for Social Leadership<br> 4. Mantra Innovator of the Year Award",
            "coverimage":"https://i.postimg.cc/D0NPsbqN/unnamed.jpg",
            "otherimages":[]
        },
        {
            "name":"ACM x CIIED Hackathon",
            "desc":"The ACM Hackathon 2022 in association with CIIED was conducted on the 6th and 7th of October and it saw a massive turnaround with 28 teams in total, pitching their idea to the judges. The Hackathon provided a platform to all students, that motivated and encouraged students to prepare themselves to participate in hackathons and enabling more startups and possibly some unicorns in the future from the BPDC Campus.<br><br><a href='https://drive.google.com/drive/folders/1CpTQGnUZXq8Wg4l6B331migDHBJuIgm-' target='_blank' style='color:blue'>Images Here</a>",
            "coverimage":"https://i.postimg.cc/J7kktYT1/asd.png",
            "otherimages":[
            ]
        },
        {
            "name":"Empower",
            "desc":"EmPower organised by CIIED and WSC teams is a one of its kind business and entrepreneurship festival held on the grounds of BITS PILANI Dubai Campus. EmPower was brought by co-organizer's Kregzo  and title partner Zoho, payment partner Tap payments, F&B partner Hunter Foods, Printing Partner Desco, and Bronze Partner Revolution Swimming Academy.  The festival witnessed students from several Universities across UAE which include SP Jain School of Global Management, Dubai, Manipal University Dubai, Amity University and more. EmPower featured strategic  and fun business events such as the Pitch Verse, faculty pitch, CEO Club, Mock Stock ,IPL Auction, Money Heist, CEO Club etc.",
            "coverimage":"https://i.postimg.cc/J0fMM9d2/empower.jpg",
            "otherimages":[
                "https://i.postimg.cc/8kqKCWww/empower1.png",
                "https://i.postimg.cc/28hHL6KY/empower2.png",
                "https://i.postimg.cc/59HK1p56/empower3.png",
                "https://i.postimg.cc/FR6SDy16/empower4.png"
            ]
        },
        {
            "name":"Talk with Dev Gupta",
            "desc":"Team CIIED presented an on-campus talk on entrepreneurship and future potential for all UG students. Mr. Dev Gupta, the guest speaker and alumnus of the BITS PILANI Dubai campus who works in the CEO's office at noon, presented his vast expertise in developing and growing organisations. His sage advice motivated students to seek greater heights.",
            "coverimage":"https://i.postimg.cc/tCJq9KSF/unnamed.png",
            "otherimages":[
                "https://i.postimg.cc/rwJ2WgPq/dev1.png",
                "https://i.postimg.cc/T2LxSVpc/dev2.png"

            ]
        },
        {
            "name":"Founders Den",
            "desc":"Founder’s Den is a pitch and networking event , organised by BPDC in collaboration with Mr. Nitin Bhalla, co-founder of Kregzo. The event witnessed several 3 minute elevator pitches from various students of BPDC, followed by a questioning round. The event highlighted new start up ideas and young entrepreneurs, learned more about ventures from the networking session among themselves.",
            "coverimage":"https://i.postimg.cc/J06Hx40B/unnamed.jpg",
            "otherimages":[]
        }
    ]
}